{
  "text": {
    "show": 65,
    "me": 39,
    "content": 12,
    "on": 45,
    "set": 64,
    "temperature": 70,
    "parameters": 48,
    "loading": 37,
    "filter": 23,
    "wheel": 78,
    "get": 29,
    "actual": 4,
    "time": 71,
    "stamp": 67,
    "of": 44,
    "running": 58,
    "scheduler": 61,
    "give": 30,
    "info": 34,
    "safety": 59,
    "precautions": 53,
    "display": 14,
    "section": 63,
    "control": 13,
    "bluvision": 7,
    "open": 46,
    "__number__": 2,
    "explanation": 20,
    "actionstep": 3,
    "element": 19,
    "check": 10,
    "by": 8,
    "user": 75,
    "page": 47,
    "go": 31,
    "to": 72,
    "number": 43,
    "extract": 21,
    "i": 33,
    "want": 77,
    "analyze": 5,
    "jd": 36,
    "internship": 35,
    "fte": 27,
    "_": 1,
    "sde": 62,
    "fy26": 28,
    "pdf": 50,
    "resume": 56,
    "final": 24,
    "aniruth": 6,
    "switch": 68,
    "2025_06_updated_analysis": 0,
    "v3": 76,
    "from": 26,
    "report_internship_": 55,
    "phonepe": 51,
    "use": 74,
    "some_data": 66,
    "file_": 22,
    "edited": 18,
    "sample": 60,
    "com": 11,
    "please": 52,
    "manual_2023": 38,
    "guide": 32,
    "for": 25,
    "now": 42,
    "updated": 73,
    "ebook1": 17,
    "robotics": 57,
    "modelling": 40,
    "parse": 49,
    "notes": 41,
    "chap": 9,
    "temp": 69,
    "pressure": 54,
    "draft": 16,
    "doc": 15
  },
  "intent": {
    "search_by_topic": 2,
    "search_by_page": 1,
    "choose_pdf": 0
  },
  "response": null,
  "action_name": {
    "action_listen": 6,
    "action_restart": 7,
    "action_session_start": 10,
    "action_default_fallback": 4,
    "action_deactivate_loop": 1,
    "action_revert_fallback_events": 8,
    "action_default_ask_affirmation": 2,
    "action_default_ask_rephrase": 3,
    "action_two_stage_fallback": 11,
    "action_unlikely_intent": 12,
    "action_back": 0,
    "action_extract_slots": 5,
    "action_search_by_topic_or_page": 9,
    "utter_pdf_selected": 13
  },
  "action_text": null,
  "intent_response_key": null
}